app/controllers/activities_controller.rb

SELECT * FROM "activities"
---
  def index
    @activities = Activity.all

SELECT * FROM "activities" WHERE ("activities"."id" = 0)
---
  def show
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("updated_at", "quest_id", "points", "bonus_points", "place_points", "user_id", "friend_points", "photo_points", "activity_type", "created_at") VALUES('2010-05-08 03:40:47', NULL, 1, NULL, NULL, 1, NULL, NULL, 1, '2010-05-08 03:40:47')
---
  def create
    @activity = Activity.new(params[:activity])
    if @activity.save

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def edit
    @activity = Activity.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 2)
---
  def update
    @activity = Activity.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 2)
DELETE FROM "activities" WHERE "id" = 2
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy