app/controllers/places_controller.rb

  def show
    @place = Place.find(params[:id])
---
SELECT * FROM "places" WHERE ("places"."id" = 1)

  def create
    @place = Place.new(params[:place])
    if @place.save
---
INSERT INTO "places" ("name", "latitude", "updated_at", "altitude", "venue_type_id", "description", "longitude", "address", "created_at") VALUES('Simple Pleasures', 128.0, '2010-05-08 05:25:55', 0.0, 3, 'Great Coffee Shop in the Outer Richmond, San Francisco', 96.0, 'Balboa Street, San Francisco', '2010-05-08 05:25:55')