app/controllers/users_controller.rb

SELECT * FROM "roles" WHERE ("roles"."name" = 'user') LIMIT 1
INSERT INTO "users" ("name", "last_login_at", "session_key", "last_request_at", "updated_at", "crypted_password", "facebook_id", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "email", "last_login_ip", "created_at") VALUES('David Sifry', NULL, NULL, '2010-05-06 21:06:06', '2010-05-06 21:06:06', '3b7f627c0888593ace570b7da66f9cf4415f965ea7592b1fcca722d1b348ae758aae03470e8b5c3a96ab89e75db8081a694da85a3e369c352c0d781724e8df18', NULL, '127.0.0.1', 'M8IDMQyCKO1xOkTsJ6eS', '2010-05-06 21:06:06', 0, '8e6557ced178a5e10e459446e89d547e5be7b5af55b27d78d604eb6b96dece8d9edbc66769c598cdea7777439230ef6fe67cba980c4dd961db19b99082c104f5', 1, 'david@sifry.com', NULL, '2010-05-06 21:06:06')
---
  def create
    @user = User.new(params[:user])
    @role = Role.find_by_name('User')
    @user.roles = [ @role ]
    if @user.save

SELECT * FROM "users"
---
  def index
    @users = User.find :all