app/controllers/venue_types_controller.rb

SELECT * FROM "venue_types"
---
  def index
    @venue_types = VenueType.all

SELECT * FROM "venue_types" WHERE ("venue_types"."id" = 1)
---
  def show
    @venue_type = VenueType.find(params[:id])

INSERT INTO "venue_types" ("name", "updated_at", "description", "created_at") VALUES('Park', '2010-05-08 05:10:06', 'A Park', '2010-05-08 05:10:06')
---
  def create
    @venue_type = VenueType.new(params[:venue_type])
    if @venue_type.save